backend/controllers/ItemController.php

    public function actionIndex($id_projeto)
    {
        $model = new Item();

        $dataProvider = new ActiveDataProvider([
            'query' => Item::find(),
        ]);

        $dataProviderMatConsumo = new ActiveDataProvider([
            'query' => Item::find()->where(['tipo_item' => 1, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalMatConsumo = Item::find()->
        where(['tipo_item' => 1, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');

        $dataProviderMatPermanente = new ActiveDataProvider([
            'query' => Item::find()->where(['tipo_item' => 2, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalMatPermanente = Item::find()->
        where(['tipo_item' => 2, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');

        $dataProviderServTerceiroPF = new ActiveDataProvider([
            'query' => Item::find()->where(['tipo_item' => 3, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalServTerceiroPF = Item::find()->
        where(['tipo_item' => 3, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');
---
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=1) AND (`id_projeto`='57')
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=2) AND (`id_projeto`='57')
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=3) AND (`id_projeto`='57')

            'query' => Item::find()->where(['tipo_item' => 4, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalServTerceiroPJ = Item::find()->
        where(['tipo_item' => 4, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');
---
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=4) AND (`id_projeto`='57')

            'query' => Item::find()->where(['tipo_item' => 5, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalPassagemNacional = Item::find()->
        where(['tipo_item' => 5, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');
---
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=5) AND (`id_projeto`='57')

            'query' => Item::find()->where(['tipo_item' => 6, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalPassagemInternacional = Item::find()->
        where(['tipo_item' => 6, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');
---
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=6) AND (`id_projeto`='57')

            'query' => Item::find()->where(['tipo_item' => 7, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalDiariaNacional = Item::find()->
        where(['tipo_item' => 7, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');
---
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=7) AND (`id_projeto`='57')

            'query' => Item::find()->where(['tipo_item' => 8, 'id_projeto' => $id_projeto]),
        ]);

        $subtotalDiariaInternacional = Item::find()->
        where(['tipo_item' => 8, 'id_projeto' => $id_projeto])->
        sum('custo_unitario * quantidade');
---
SELECT SUM(custo_unitario * quantidade) FROM `item` WHERE (`tipo_item`=8) AND (`id_projeto`='57')

    public function actionCreate($tipo_item, $id_projeto)
    {
        $model = new Item();
        $model->tipo_item = $tipo_item;
        $model->id_projeto = $id_projeto;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `item` (`tipo_item`, `id_projeto`, `natureza`, `professor_responsavel`, `numero_item`, `justificativa`, `quantidade`, `custo_unitario`, `descricao`) VALUES (1, 47, '', 79, '', '', NULL, NULL, '')

    protected function findModel($id)
    {
        if (($model = Item::findOne($id)) !== null) {
---
SELECT * FROM `item` WHERE `id`='7'