backend/controllers/ProjetoController.php

    public function actionCreate()
    {
        $model = new Projeto();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `projeto` (`titulo_projeto`, `nome_coordenador`, `num_processo`, `num_protocolo`, `edital`, `inicio_previsto`, `termino`, `cotacao_moeda_estrangeira`, `numero_fapeam_outorga`) VALUES ('', '', '', '', '', '2022-02-22 00:00:00', '2023-02-22 00:00:00', NULL, '')