backend/controllers/RelatorioPrestacaoController.php

SELECT EXISTS(SELECT * FROM `projeto` WHERE `projeto`.`id`='2')
SELECT * FROM `projeto`
INSERT INTO `relatorio_prestacao` (`data_prevista`, `data_enviada`, `tipo`, `situacao`, `tipo_anexo`, `id_projeto`) VALUES (NULL, NULL, '', '', NULL, 2)
---
    public function actionCreate()
    {
        $model = new RelatorioPrestacao();
        $projetos = Projeto::find()->all();
        $array_projetos = ArrayHelper::map($projetos, 'id', 'titulo_projeto');

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `projeto`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $projetos = Projeto::find()->all();

SELECT * FROM `relatorio_prestacao` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = RelatorioPrestacao::findOne($id)) !== null) {