backend/controllers/TermoAditivoController.php

    public function actionCreate($id)
    {

        $model = new TermoAditivo();
        $projetos = Projeto::find()->all();
---
SELECT * FROM `projeto`

    public function actionDelete($id)
    {
        $termoAditivo = $this->findModel($id);
        $idProjeto = $termoAditivo->id_projeto;
        $termoAditivo->delete();
---
DELETE FROM `termo_aditivo` WHERE `id`=1

    protected function findModel($id)
    {
        if (($model = TermoAditivo::findOne($id)) !== null) {
---
SELECT * FROM `termo_aditivo` WHERE `id`='1'