backend/controllers/TermoAditivoController.php

    protected function findModel($id)
    {
        if (($model = TermoAditivo::findOne($id)) !== null) {
---
SELECT * FROM `termo_aditivo` WHERE `id`='1'