backend/views/termo-aditivo/index.php

SELECT * FROM `projeto` WHERE `id`=59
---
            'numero_do_termo',
            'motivo:ntext',
            'vigencia',
/*          [
                'attribute' => 'id_projeto',
                'value' => function ($data) {
                    return Projeto::findOne($data->id_projeto)->titulo_projeto;
                },
            ],